# Day 10: DataFrame Concatenation
## Combining multiple DataFrames using pd.concat()

### Import Libraries
Importing pandas for data manipulation

In [1]:
import pandas as pd

### Create First Employee Dataset
Employee data with US cities (10 records)

In [4]:
employee_data_1 = {
    "Name": ["John", "Jane", "Jack", "Jill", "Ali", "Iqbal", "Hassan", "Hina", "Hafsa", "Hassan"],
    "Age": [25, 30, 35, 40, 45, 50, 55, 60, 65, 70],
    "City": ["New York", "Los Angeles", "Chicago", "Houston", "Phoenix", "Philadelphia", "San Antonio", "San Diego", "Dallas", "San Jose"],
    "Salary": [50000, 60000, 70000, 80000, 90000, 100000, 110000, 120000, 130000, 140000]
}
df_employee_1 = pd.DataFrame(employee_data_1)
df_employee_1

     Name  Age          City  Salary
0    John   25      New York   50000
1    Jane   30   Los Angeles   60000
2    Jack   35       Chicago   70000
3    Jill   40       Houston   80000
4     Ali   45       Phoenix   90000
5   Iqbal   50  Philadelphia  100000
6  Hassan   55   San Antonio  110000
7    Hina   60     San Diego  120000
8   Hafsa   65        Dallas  130000
9  Hassan   70      San Jose  140000

### Create Second Employee Dataset
Employee data with Pakistani cities (5 records)

In [5]:
employee_data_2 = {
    "Name": ["Noman", "Ali", "Ahmed", "Usman", "Hassan"],
    "Age": [25, 30, 35, 40, 45],
    "Salary": [50000, 60000, 70000, 80000, 90000],
    "City": ["Karachi", "Lahore", "Islamabad", "Peshawar", "Quetta"]
}
df_employee_2 = pd.DataFrame(employee_data_2)
df_employee_2

     Name  Age  Salary       City
0   Noman   25   50000    Karachi
1     Ali   30   60000     Lahore
2   Ahmed   35   70000  Islamabad
3   Usman   40   80000   Peshawar
4  Hassan   45   90000     Quetta

### Vertical Concatenation (axis=0)
Stacking DataFrames row-wise to combine all employee records

In [7]:
df_concate_ver = pd.concat([df_employee_1, df_employee_2], axis=0, ignore_index=True)
df_concate_ver

      Name  Age          City  Salary
0     John   25      New York   50000
1     Jane   30   Los Angeles   60000
2     Jack   35       Chicago   70000
3     Jill   40       Houston   80000
4      Ali   45       Phoenix   90000
5    Iqbal   50  Philadelphia  100000
6   Hassan   55   San Antonio  110000
7     Hina   60     San Diego  120000
8    Hafsa   65        Dallas  130000
9   Hassan   70      San Jose  140000
10   Noman   25       Karachi   50000
11     Ali   30        Lahore   60000
12   Ahmed   35     Islamabad   70000
13   Usman   40      Peshawar   80000
14  Hassan   45        Quetta   90000

### Horizontal Concatenation (axis=1)
Merging DataFrames column-wise, creating NaN values for mismatched rows

In [8]:
df_concate_hor = pd.concat([df_employee_1, df_employee_2], axis=1, ignore_index=True)
df_concate_hor

        0   1             2       3       4     5        6          7
0    John  25      New York   50000   Noman  25.0  50000.0    Karachi
1    Jane  30   Los Angeles   60000     Ali  30.0  60000.0     Lahore
2    Jack  35       Chicago   70000   Ahmed  35.0  70000.0  Islamabad
3    Jill  40       Houston   80000   Usman  40.0  80000.0   Peshawar
4     Ali  45       Phoenix   90000  Hassan  45.0  90000.0     Quetta
5   Iqbal  50  Philadelphia  100000     NaN   NaN      NaN        NaN
6  Hassan  55   San Antonio  110000     NaN   NaN      NaN        NaN
7    Hina  60     San Diego  120000     NaN   NaN      NaN        NaN
8   Hafsa  65        Dallas  130000     NaN   NaN      NaN        NaN
9  Hassan  70      San Jose  140000     NaN   NaN      NaN        NaN